
/* Shared Error Strings for MacConfig Apps */

/****** ACP Errors *******/

/* GenericACPError */
"GenericACPError" = "Varmista, että Apple Wi-Fi ‑tukiasema on liitetty ja tietokoneen kantaman sisällä tai liitetty ethernetin kautta, ja yritä uudelleen. (%d)";

/****** Problem Codes *******/

/* Problem codes reported by the base station that AirPort Utility doesn't know about */
"tooNew" = "Tuntematon ongelma (%@)";
"tooNew.description" = "Tämä Apple Wi-Fi ‑tukiasema raportoi tuntemattomasta ongelmasta. Päivitä AirPort-työkalu osoittamalla Ohjelmiston päivitys ja yritä uudelleen.";
"tooNew.remedy" = "Ohjelmiston päivitys…";

/* kACPProblemCodeUnknown */
"unkn" = "Tuntematon ongelma";
"unkn.description" = "Tämä Apple Wi-Fi ‑tukiasema raportoi tuntemattomasta ongelmasta. Voit yrittää laittaa sen pois päältä ja takaisin päälle, etsiä uudempaa laiteohjelmistoa tai nollata laitteen. Nollaaminen poistaa kaikki asetukset ja laite on otettava käyttöön uudelleen.";

/* kACPProblemCodeWANNoLink */
"waNL" = "Ethernet irrotettu";
"waNL.description" = "WAN-porttiin ei ole liitetty mitään. Jos käytät DSL-, kaapeli- tai muuta laajakaistamodeemia internet-yhteyden muodostamiseen tai jos käytät verkkoa, joka on yhteydessä internetiin, liitä laajakaistamodeemi tai verkko WAN-porttiin.";
"waNL.furtherInfo" = "Osoita WAN-portin ethernet-yhteyden tarkistamisen jälkeen ”Tarkista Ethernet WAN -portti”.";
"waNL.retest" = "Tarkista Ethernet WAN -portti";

/* kACPProblemCodeWANNoInternet */
"waNI" = "Internet-yhteys";
"waNI.description" = "Apple Wi-Fi ‑tukiasemalla ei ole kelvollista IP-osoitetta. Varmista, että Apple Wi-Fi ‑tukiasema on liitetty laajakaistamodeemiin tai lähiverkkoon, tarkista asetukset ja yritä uudelleen. Jos et vieläkään saa yhteyttä, ota yhteys internet-palveluntarjoajaan.";
"waNI.furtherInfo" = "Yleisin ratkaisu ongelmaan on laajakaistamodeemin nollaaminen. Nollaa modeemi sammuttalla se, odottamalla 5 minuuttia ja käynnistämällä se uudelleen.";
"waNI.remedy" = "Internet…";

/* kACPProblemCodeRadioNoNetwork */
"raNN" = "Langaton verkko";
"raNN.description" = "Tämä Apple Wi-Fi ‑tukiasema on asetettu liittymään tiettyyn langattomaan verkkoon, jota ei löytynyt. Jos verkkoa, johon haluat liittyä, ei näy Verkon nimi ‑ponnahdusvalikossa, yritä uudelleen syöttämällä verkon nimi ja tarvittaessa salasana.";
"raNN.remedy" = "Langaton…";

/* kACPProblemCodeWDSNoPartner */
"wdsP" = "WDS-virhe";
"wdsP.description" = "Tämä Apple Wi-Fi ‑tukiasema on otettu käyttöön osana WDS-verkkoa, mutta muita Apple Wi-Fi ‑tukiasemia ei löytynyt.";
"wdsP.furtherInfo" = "Varmista, että langattomien WDS-laitteiden MAC-osoitteet ovat oikein. Varmista, että langattomat laitteet on liitetty virtalähteeseen ja että ne ovat tämän Apple Wi-Fi ‑tukiaseman kantaman sisällä.";
"wdsP.remedy" = "WDS…";

/* kACPProblemCodePPPoENoServer */
"ppNS" = "PPPoE-palvelin";
"ppNS.description" = "Tämä Apple Wi-Fi ‑tukiasema on asetettu yhdistämään internetiin PPPoE:tä käyttäen, mutta PPPoE-palvelinta ei löytynyt. Varmista, että internet-palveluntarjoaja edellyttää PPPoE:n käyttöä ja että modeemi on päällä ja liitetty tämän Apple Wi-Fi ‑tukiaseman WAN-porttiin, ja yritä uudelleen. Jos et edelleenkään saa yhteyttä palvelimeen, ota yhteys palveluntarjoajaan.";
"ppNS.remedy" = "PPPoE…";

/* kACPProblemCodePPPoEBadPassword */
"ppBP" = "PPPoE-salasana";
"ppBP.description" = "Tämä Apple Wi-Fi ‑tukiasema on asetettu yhdistämään internetiin PPPoE:tä käyttäen ja syötetty salasana on virheellinen. Syötä oikea salasana ja yritä uudelleen. Jos et edelleenkään saa yhteyttä, ota yhteys internet-palveluntarjoajaan.";
"ppBP.remedy" = "PPPoE…";

/* kACPProblemCodeRADIUSNoServer */
"rdNS" = "RADIUS-palvelin";
"rdNS.description" = "Tämä Apple Wi-Fi ‑tukiasema on asetettu yhdistämään internetiin WPA Enterprise ‑suojausta tai RADIUS-käytönvalvontaa käyttäen, mutta RADIUS-palvelinta ei löytynyt. Varmista, että palvelimen asetukset ovat oikein, ja yritä uudelleen.";
"rdNS.remedy" = "Pääsynhallinta…";

/* kACPProblemCodeLowUSBPower */
"usbp" = "USB-virta"; 
"usbp.description" = "Apple Wi-Fi ‑tukiasemaan liitetty laite vaatii enemmän virtaa kuin tämä Apple Wi-Fi ‑tukiasema voi tarjota. Jos mahdollista, liitä laite virtalähteeseen tai aktiiviseen USB-keskittimeen.";
"usbp.remedy" = "Levyt…";

/* kACPProblemCodeDiskNeedsRepair */
"fsck" = "Levy tarvitsee korjausta";
"fsck.description" = "Apple Wi-Fi ‑tukiasemaan liitetyn levyn kanssa on ongelma. Liitä levy tietokoneeseen ja korjaa levy.";
"fsck.remedy" = "Levyt…";

/* kACPProblemCodeInternalDiskNeedsRepair */
"Ifsc" = "Sisäinen levy on korjattava";
"Ifsc.description" = "Time Capsule -levyn kanssa on ongelma.";
"Ifsc.remedy" = "Levyt…";

/* kACPProblemCodeLowDiskSpace */
"fslo" = "Levytila on vähissä";
"fslo.description" = "Apple Wi-Fi ‑tukiasemaan liitetyn levyn tallennustila on vähissä.";
"fslo.remedy" = "Levyt…";

/* kACPProblemCodeInternalLowDiskSpace */
"Ifsl" = "Sisäisen levyn levytila on vähissä";
"Ifsl.description" = "Time Capsule -levyn levytila on vähissä.";
"Ifsl.remedy" = "Levyt…";

/* kACPProblemCodeUnsupportedDisk */
"unsD" = "Ei-tuettu levy";
"unsD.description" = "Apple Wi-Fi ‑tukiasemaan liitettyä levyä ei tueta, eikä sitä voida käyttää. Kokeile eri levyä.";
"unsD.remedy" = "Levyt…";

/* kACPProblemCodeWANRejectedDHCPOffer */
"waRj" = "Ristiriitainen DHCP-alue";
"waRj.description" = "Tämä Apple Wi-Fi ‑tukiasema hylkäsi DHCP-osoitteen, joka on samassa aliverkossa kuin sen sisäinen DHCP-palvelin. Apple Wi-Fi ‑tukiasema tulee todennäköisesti laittaa siltatilaan. Jos haluat edelleen käyttää DHCP:tä ja NAT:ia yhden IP-osoitteen jakamiseen, muuta DHCP-aluetta.";
"waRj.remedy" = "Internet…";

/* kACPProblemCodeUnconfigured */
"ctim" = "Oletusasetukset";
"ctim.description" = "Tässä Apple Wi-Fi ‑tukiasemassa on oletusasetukset. Määritä Apple Wi-Fi ‑tukiasema yhdistämään internetiin, suojaa langaton verkko ja syötä salasana.";

/* kACPProblemCodeSoftResetActive */
"soft" = "Nollaus";
"soft.description" = "Tämä Apple Wi-Fi ‑tukiasema on nollattu, ja pääset väliaikaisesti muuttamaan asetuksia, jotka estivät sinua käyttämästä verkkoa.";

/* kACPProblemCodeOpenNetwork */
"opNW" = "Suojaamaton langaton verkko";
"opNW.description" = "Apple Wi-Fi ‑tukiaseman langatonta verkkoa ei ole suojattu. Langaton verkko on suositeltavaa suojata WPA2 Personal ‑suojauksella.";
"opNW.remedy" = "Muuta suojausta…";
"opNW.assistDescription" = "Jos et muuta suojaustilaa, Apple Wi-Fi ‑tukiaseman merkkivalo vilkkuu keltaisena. Haluatko varmasti jatkaa?";

/* kACPProblemCodePublicPassword */
"pubP" = "Oletussalana";
"pubP.description" = "Tämä Apple Wi-Fi ‑tukiasema on suojattu oletussalasanalla. Apple Wi-Fi ‑tukiaseman salasanan muuttaminen on suositeltavaa.";
"pubP.remedy" = "Vaihda salasana…";
"pubP.assistDescription" = "Jos et muuta salasanaa, Apple Wi-Fi ‑tukiaseman merkkivalo vilkkuu keltaisena. Haluatko varmasti jatkaa?";

/* kACPProblemCodeDoubleNAT */
"DubN" = "Kaksinkertainen NAT";
"DubN.description" = "Tämän Apple Wi-Fi ‑tukiaseman WAN-portissa on yksityinen IP-osoite. Se on liitetty laitteeseen tai verkkoon, joka käyttää NAT:ia yksityisten IP-osoitteiden tarjoamiseen. Siirrä Apple Wi-Fi ‑tukiasema DHCP:n ja NAT:in käyttämisestä siltatilaan.";
"DubN.remedy" = "Internet…";

/* kACPProblemCodeWideAreaBonjourAuth */
"wbAu" = "Bonjour-todentaminen";
"wbAu.description" = "DNS-palvelimen käyttäjätunnus ja salasana on virheellinen. Korjaa käyttäjätunnus ja salasana ja yritä uudelleen. Jos ongelma jatkuu, ota yhteyttä DNS-palvelimen ylläpitäjään.";
"wbAu.remedy" = "Bonjour…";

/* kACPProblemCodeNonDWDSMain */
"bsWD" = "Laajennettu verkko";
"bsWD.description" = "Tämä Apple Wi-Fi ‑tukiasema ei voinut laajentaa langatonta verkkoa. Varmista, että langaton verkko, jota yrität laajentaa, on otettu käyttöön ja toimii oikein, että syötit langattoman verkon salasanan oikein tähän laitteeseen ja että laite on langattoman verkon kantaman sisällä.";
"bsWD.remedy" = "Langaton…";

/* kACPProblemCodeUpdateAvailable */
"upAv" = "Laiteohjelmistopäivitys saatavilla";
"upAv.description" = "Jos haluat hakea uusimman laiteohjelmiston tälle Apple Wi-Fi ‑tukiasemalle, osoita Päivitä laiteohjelmisto.";
"upAv.remedy" = "Päivitä laiteohjelmisto…";

/* kACPProblemCodeSNMPConfigOverWAN */
"waSN" = "SNMP WAN-portin kautta";
"waSN.description" = "Tämä Apple Wi-Fi ‑tukiasema on asetettu sallimaan SNMP WAN-portin kautta, mikä heikentää verkon suojausta.";
"waSN.remedy" = "Loki ja SNMP…";

/* kACPProblemCodeConfigOverWAN */
"waCF" = "Määrittely WAN-portin kautta";
"waCF.description" = "Tämä Apple Wi-Fi ‑tukiasema on asetettu sallimaan määritys WAN-portin kautta, mikä heikentää verkon suojausta.";
"waCF.remedy" = "Tukiasema…";

/* kACPProblemCodeNoDNSServers */
"nDNS" = "Ei nimipalvelimia";
"nDNS.description" = "Tällä Apple Wi-Fi ‑tukiasemalla ei ole DNS-palvelimien osoitteita, ja sillä saattaa olla vaikeuksia yhdistää internetiin.";
"nDNS.remedy" = "Internet…";

/* kACPProblemCodeOldTimeZone */
"timz" = "Ohjelmistopäivitys saatavilla";
"timz.description" = "Päivitä AirPort-työkalu osoittamalla Ohjelmiston päivitys ja yritä uudelleen.";
"timz.remedy" = "Ohjelmiston päivitys…";

/* kACPProblemCodeTaskInProgress */
"TaIP" = "Tämä Apple Wi-Fi ‑tukiasema on varattu";
"TaIP.description" = "Älä irrota tai nollaa tätä Apple Wi-Fi ‑tukiasemaa ennen kuin se on käytettävissä.";

/* kACPProblemCodeDotMacCredentialsRejected */
"dMCR" = "MobileMe-käyttäjätunnus tai -salasana on virheellinen";
"dMCR.description" = "MobileMe-käyttäjätunnus tai -salasana on virheellinen. Syötä oikea käyttäjätunnus ja salasana ja yritä uudelleen.";

/* kACPProblemCodeOverTemperature */
"oTMP" = "Laite saattaa ylikuumeta";
"oTMP.description" = "Jos Apple Wi-Fi ‑tukiasema tuntuu kuumalta, siirrä se toiseen paikkaan tai poista sen jäähdytystä mahdollisesti haittaavat esineet.";

/* kACPProblemCodeIPv6TunnelError */
"6gdn" = "IPv6-tunnelointivirhe";
"6gdn.description" = "IPv6-tunnelin päätepisteessä tapahtui virhe. Odota, että palvelu palautetaan ja yritä uudelleen. Jos ongelma jatkuu, ota yhteyttä palveluntarjoajaan.";
"6gdn.remedy" = "IPv6-asetukset…";

/* kACPProblemCodeIPv6RelayError */
"6rdn" = "IPv6-välitysvirhe";
"6rdn.description" = "IPv6-välitysreitittimessä tapahtui virhe. Odota, että palvelu palautetaan ja yritä uudelleen. Jos ongelma jatkuu, ota yhteyttä palveluntarjoajaan.";
"6rdn.remedy" = "IPv6-asetukset…";

/* kACPProblemCodeMigrationInterrupted */
"mgrt" = "Siirtäminen keskeytetty";
"mgrt.description" = "Time Capsule -levyn siirtäminen on keskeytetty.";
"mgrt.remedy" = "Levyt…";

/* kACPProblemCodePostMigrationErase */
"mgEr" = "Siirtäminen suoritettu";
"mgEr.description" = "Levyn siirtäminen on suoritettu. Tyhjennä vanha Time Capsule -levy osoittamalla Jatka.";

/* kACPProblemCodeSMARTStatusWarning */
"SSdF" = "Time Capsulen levy on vikaantumassa";
"SSdF.description" = "Time Capsulen levyn kanssa on ongelma. Liitä USB-kovalevy Time Capsuleen ja arkistoi ja varmuuskopioi sen tiedot AirPort-työkalun Levyt-osiolla. Vieraile paikallisen Apple Storen Genius Barissa tai valtuutetulla Apple-palveluntarjoajalla korjausta varten.";
"SSdF.remedy" = "Levyt…";

/****** Task Strings *******/

/* kACPTaskErasingDisk */
"EraD" = "Tyhjennetään AirPort-levyä";
"EraD.description" = "AirPort-levyä %@ tyhjennetään. Tyhjentämistä ei voida kumota.";

/* kACPTaskErasingInternalDisk */
"EraI" = "Tyhjennetään Time Capsule -levyä";
"EraI.description" = "Time Capsule -levyn tyhjentämistä ei voida kumota.";

/* kACPTaskArchivingInternalDisk */
"ArcI" = "Arkistoidaan Time Capsule -levyä";
"ArcI.description" = "Time Capsule -levyä %1$@ arkistoidaan AirPort-levylle %2$@. Pysäytä arkistointi osoittamalla Kumoa.";



/****** Validation Errors *******/

/* Generic Errors */

/* vGenErrorZeroLength */
"gErA" = "Kohteen %@ arvo tarvitaan.";

/* vGenErrorTooShort */
"gErB" = "Kohteen %@ arvo on liian lyhyt.";

/* vGenErrorTooLong */
"gErC" = "Kohteen %@ arvo on liian pitkä.";

/* vGenErrorNotSupported */
"gErD" = "Tämä Apple Wi-Fi ‑tukiasema ei tue asetusta ”%@”.";

/* vGenErrorInvalid */
"gErE" = "Kohteen %@ arvo on virheellinen.";

/* vGenErrorTooHigh */
"gErF" = "Kohteen ”%@” arvo on liian korkea.";

/* vGenErrorTooLow */
"gErG" = "Kohteen %@ arvo on liian alhainen.";

/* vGenErrorTooManyEntriesInList */
"gErH" = "Taulukossa %@ on liian monta kohdetta.";

/* Specific Errors */

/* vWarnPasswordIsPublic */ 
"vErr.pwPu" = "Parempi suoja saadaan käyttämällä eri salasanaa kuin ”public”.";

/* vErrSysLogCollectorInvalid */
"vErr.slCI" = "Syslog-palvelimen IP-osoite on virheellinen.";
/* vErrSysLogLevelInvalid */
"vErr.slLI" = "Syslog-taso on virheellinen.";

/* vErrWSecModeUnsupported */
"vErr.wsMU" = "Tämä Apple Wi-Fi ‑tukiasema ei tue valittua langattoman verkon suojaustilaa.";

/* vErrInvalidWEP40Key */
"vErr.iw4K" = "Annettu 40-bittinen WEP-avain ei ole kelvollinen.";
/* vErrInvalidWEP104Key */
"vErr.iw1K" = "Annettu 128-bittinen WEP-avain ei ole kelvollinen.";

/* vErrInvalidTSNKey */
"vErr.iTSN" = "Transitional Security Network -verkon langattoman salasanan täytyy olla täsmälleen 13 merkkiä pitkä.";

/* vErrInvalidWPAKey */
"vErr.iWPA" = "WPA Personal -verkon langattoman salasanan täytyy olla 8 - 63 merkkiä pitkä. Se voi olla myös 64 heksadesimaalimerkkiä.";

/* vErrGroupKeyTimeoutTooShort */
"vErr.ktTS" = " Annettu ryhmäavaimen vanhenemisaika on liian lyhyt. Sen on oltava vähintään 10 minuuttia.";
/* vErrGroupKeyTimeoutTooLong */
"vErr.ktTL" = "Annettu ryhmäavaimen vanhenemisaika on liian pitkä. Se saa olla enintään 9999999 minuuttia.";

/* vErrAutoChannelSelectionNotSupported */
"vErr.acNS" = "Tämä Apple Wi-Fi ‑tukiasema ei tue automaattista kanavan valintaa.";

/* vErrMultiRateNotValidForLowDensity */
"vErr.nvLD" = "Valittu multicast-tiheys ei sovellu pienelle radiolaitetiheydelle.";
/* vErrMultiRateNotValidForMedDensity */
"vErr.nvMD" = "Valittu multicast-tiheys ei sovellu keskisuurelle radiolaitetiheydelle.";
/* vErrMultiRateNotValidForHighDensity */
"vErr.nvHD" = " Valittu multicast-tiheys ei sovellu suurelle radiolaitetiheydelle.";
/* vErrMultiRateNotValidForBNetwork */
"vErr.nvBN" = "Valittu multicast-tiheys ei sovellu 802.11b ja 802.11 b/g -yhteensopiville verkoille.";
/* vErrMultiRateNotValidForGNetwork */
"vErr.nvGN" = " Valittu multicast-tiheys ei sovellu 802.11g-verkolle.";

/* vErrSTAModeNotSupported */
"vErr.smNS" = "Tämä Appe Wi-Fi ‑tukiasema ei tue asiakastilaa.";
/* vErrWirelessDisabledModeNotSupported */
"vErr.wdNS" = "Tämä Appe Wi-Fi ‑tukiasema ei tue radion poistamista käytöstä.";

/* vErrDHCPOnlyRequiresStaticIP */
"vErr.DHSt" = "IP-osoitealueen jakaminen vain DHCP:tä käyttäen edellyttää WAN IP ‑osoitteen määrittämistä käsin. Jos internet-palveluntarjoaja antaa sinulle staattisen IP-osoitealueen, määritä Apple Wi-Fi ‑tukiasema käyttämään ensimmäistä IP-osoitetta ja jaa muut DHCP:llä.";

/* vErrRouterSubnetMismatch */
"vErr.rsMM" = "Annettu reitittimen osoite ei ole yhteensopiva WAN-IP-osoitteen kanssa.";
/* vErrWANIPNotSameAsRouter */
"vErr.wnSR" = "WAN-IP-osoite ei voi olla sama kuin reitittimen IP-osoite.";

/* vErrIPv6ManualTunnelRequiresStaticIP */
"vErr.v6TM" = "Käsin määritelty IPv6-tunneli edellyttää kiinteää WAN-IP-osoitetta.";

/* vErrWANDisableEthernetNotSupported */
"vErr.pcDE" = "Tämä Appe Wi-Fi ‑tukiasema ei tue WAN-portin poistamista käytöstä.";

/* vErrWANManagementRequiresWANPortEnabled */
"vErr.waNM" = "Etähallinnan salliminen WAN-portin kautta edellyttää, että WAN-portti on käytössä.";

/* vErrRouterModeNoBridgeForPPP */
"vErr.rmBP" = "Jos käytetään PPPoE:tä tai PPP-yhteyttä modeemilla, on valittava DHCP/NAT.";

/* vErrRouterModeNoDHCPNATForSTA */
"vErr.rmST" = "Internet-yhteyden jakamista ei tueta, kun Apple Wi-Fi ‑tukiasema on määritetty liittymään langattomaan verkkoon."; 

/* vErrDHCPRangeConflictsWithWANIP */
"vErr.dcWW" = "Syötetty DHCP-alue on ristiriidassa Apple Wi-Fi ‑tukiaseman WAN IP ‑osoitteen kanssa.";
/* vErrDHCPRangeEndpointsAreInvalid */
"vErr.dhRa" = "DHCP-alueen alku- tai loppuosoite on virheellinen.";

/* vErrWDSWithWPANotSupported */
"vErr.wwNS" = "Tämä Apple Wi-Fi ‑tukiasema ei tue WPA:ta WDS:n kanssa. Varmista, että käytät uusinta laiteohjelmistoa.";

/* vErrWDSRequiresAtLeastOneNode */
"vErr.w1Nd" = "WDS edellyttää useita Apple Wi-Fi ‑tukiasemia. Lisää vähintään yksi WDS-jäsen.";

/* vErrWDSWithWPAEnterprise */
"vErr.wdEn" = "WDS ja WPA Enterprise eivät ole yhteensopivia. Jos haluat määritellä WDS-verkon, käytä WPA personalia.";

/* vErrWDSInFiveGig */
"vErr.wdFi" = "WDS ei ole yhteensopiva 5 GHz:n taajuutta käyttävien radiotilojen kanssa. Vaihda radiotilaa ja yritä uudelleen.";

/* vErrAccessControlListIsEmpty */
"vErr.acEm" = "MAC-osoitteen perusteella tapahtuva pääsynhallinta on päällä, mutta yhtään osoitetta ei ole määritelty. Lopeta pääsynhallinta MAC-osoitteen perusteella tai lisää luetteloon osoitteita.";

/* vErrRequiresWABEnabled */
"vErr.rWAB" = "Palvelun mainostaminen Bonjourilla laajemmin vaatii laajaverkkopalvelinnimeä. Voit määritellä Bonjour-asetukset osoittamalla AirPort-asetusten osion %@ ”Muokkaa…”-painiketta.";

/* End of AirePortErrors.strings file */
